### Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2020, 8, 8, 11, 11, 43, 961360)

In [4]:
today_date-datetime.timedelta(3)

datetime.datetime(2020, 8, 5, 11, 11, 43, 961360)

In [5]:
#### List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [6]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Day"]

In [7]:
data.head()

                         Day
0 2020-08-08 11:11:43.961360
1 2020-08-07 11:11:43.961360
2 2020-08-06 11:11:43.961360
3 2020-08-05 11:11:43.961360
4 2020-08-04 11:11:43.961360

In [12]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2020-08-08 11:11:43.961360   Saturday
1 2020-08-07 11:11:43.961360     Friday
2 2020-08-06 11:11:43.961360   Thursday
3 2020-08-05 11:11:43.961360  Wednesday
4 2020-08-04 11:11:43.961360    Tuesday

In [13]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [14]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [15]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [16]:
data

                          Day    weekday  weekday_ordinal
0  2020-08-08 11:11:43.961360   Saturday                6
1  2020-08-07 11:11:43.961360     Friday                5
2  2020-08-06 11:11:43.961360   Thursday                4
3  2020-08-05 11:11:43.961360  Wednesday                3
4  2020-08-04 11:11:43.961360    Tuesday                2
5  2020-08-03 11:11:43.961360     Monday                1
6  2020-08-02 11:11:43.961360     Sunday                7
7  2020-08-01 11:11:43.961360   Saturday                6
8  2020-07-31 11:11:43.961360     Friday                5
9  2020-07-30 11:11:43.961360   Thursday                4
10 2020-07-29 11:11:43.961360  Wednesday                3
11 2020-07-28 11:11:43.961360    Tuesday                2
12 2020-07-27 11:11:43.961360     Monday                1
13 2020-07-26 11:11:43.961360     Sunday                7
14 2020-07-25 11:11:43.961360   Saturday                6

#### Count Or Frequency Encoding

In [17]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [18]:
columns=[1,3,5,6,7,8,9,13]

In [19]:
train_set=train_set[columns]

In [20]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [21]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [22]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [23]:
country_map=train_set['Country'].value_counts().to_dict()

In [24]:
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' Greece': 29,
 ' France': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Trinadad&Tobago': 19,
 ' Cambodia': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [25]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

##### Advantages
1. Easy To Use
2. Not increasing feature space
##### Disadvantages
1. It will provide same weight if the frequencies are same

#### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [28]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [29]:
df=df[['survived', 'deck']]

In [30]:
df['deck'].fillna('Missing',inplace=True)

In [31]:
df['deck']=df['deck'].astype(str).str[0]

In [32]:
df.head()

   survived deck
0         0    M
1         1    C
2         1    M
3         1    C
4         0    M

In [33]:
df['deck'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F'], dtype=object)

In [35]:
df.groupby(['deck'])['survived'].mean()

deck
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299419
Name: survived, dtype: float64

In [36]:
df.groupby(['deck'])['survived'].mean().sort_values().index

Index(['M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='deck')

In [37]:
ordinal_labels=df.groupby(['deck'])['survived'].mean().sort_values().index
ordinal_labels

Index(['M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='deck')

In [38]:
enumerate(ordinal_labels,0)

In [39]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'M': 0, 'A': 1, 'G': 2, 'C': 3, 'F': 4, 'B': 5, 'E': 6, 'D': 7}

In [40]:
df['deck_ordinal_labels']=df['deck'].map(ordinal_labels2)
df.head()

   survived deck  deck_ordinal_labels
0         0    M                    0
1         1    C                    3
2         1    M                    0
3         1    C                    3
4         0    M                    0

#### Mean Encoding

In [41]:
mean_ordinal=df.groupby(['deck'])['survived'].mean().to_dict()

In [42]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29941860465116277}

In [43]:
df['mean_ordinal_encode']=df['deck'].map(mean_ordinal)
df.head()

   survived deck  deck_ordinal_labels  mean_ordinal_encode
0         0    M                    0             0.299419
1         1    C                    3             0.593220
2         1    M                    0             0.299419
3         1    C                    3             0.593220
4         0    M                    0             0.299419